datably/load-tests/load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://www.artillery.io
  engines:
    playwright: 
      extendedMetrics: true
  processor: 'playwright-scripts/user-actions/user-actions.ts'
  timeout: 10000
  phases:
    - duration: 50
      arrivalCount: 10
      name: Load test
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
#  ensure:
#    thresholds:
#      - http.response_time.p95: 10000
scenarios:
  - engine: playwright
    testFunction: 'loginAndNavigateRoutes'