datably/load-tests/load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://www.artillery.io
  engines:
    playwright: 
      extendedMetrics: true
  processor: 'temp/user-actions/user-actions.ts'
  timeout: 180000
  phases:
    - duration: 600
      arrivalCount: 50
      name: Load test
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
#  ensure:
#    thresholds:
#      - http.response_time.p95: 10000
scenarios:
  - engine: playwright
    testFunction: 'SRU13_CreateADataViewAndReport'
  - engine: playwright
    testFunction: 'SRU15_CheckingAPersonProfile'
  - engine: playwright
    testFunction: 'SRU16_ViewingEventRegistration'
  - engine: playwright
    testFunction: 'SRU17_VisitExternalPageAccountAndBrowse'
  - engine: playwright
    testFunction: 'SRU18_Groups'
  - engine: playwright
    testFunction: 'SRU19_EventExternalPage'